var app1 = new Vue({
    el: "#list_menu",
    data: {
        iconDisplay: 'true',
        select_menu: false,
        index_menu: 0,
        id_menu: 0,
        name: "",
        meat: "Pork", // category meat
        method: "Fried Food", // category type cooking
        category: "Chinese", // category nation
        is_favorite: false,
        select_show: false,
        image: "",
        days: "0",
        hours: "0",
        minutes: "0",
        ingrediant: "", // ส่วนประกอบ 1 ข้อ
        material: [], // list ส่วนประกอบ
        howTo: "", // วิธีทำ 1 ข้อ
        methods: [], // list วิธีทำ
        // products: [],
        products: [
            {
                id_menu: 1001,
                id_create:1,
                name: "ข้าวมันไก่",
                meat: "Chicken",
                category: "Thai",
                method: "Cook Food", //หุง
                is_favorite: false,
                select_show: false,
                image: "img-food/ข้าวมันไก่.jpg",
                material: [
                    "น่องไก่/สะโพกไก่/อกไก่ (ตามชอบ)",
                    "กระเทียม 3-4 หัว",
                    "รากผักชี 6 ราก",
                    "ขิงแก่หั่นเป็นแผ่นบาง 6 แผ่น",
                    "พริกไทย 30 เม็ด",
                    "เกลือ 1.5 ช้อนโต๊ะ",
                    "น้ำตาลกรวด 0.5 ช้อนโต๊ะ",
                    "ข้าวสารดิบ 2 ถ้วยตวง",
                    "ซีอิ๊วขาว 3 ช้อนโต๊ะ",
                    "น้ำมันพืช 0.5 ช้อนโต๊ะ",
                    "แตงกวา",
                    "ผีกชี",
                ],
                methods: [
                    "ต้มน้ำซุปต้มไก่ โดยใส่ รากผักชี กระเทียม พริกไทย ขิง น้ำตาลกรวด ซีอิ๊วขาว เกลือ เคี่ยวประมาณ 15 นาที นำไก่ลงไปต้มต่อจนไก่สุก ใช้เวลาประมาณ 30 นาที",
                    "นำไก่ที่สุกแล้วไปน็อกในน้ำผสมน้ำแข็ง จนไก่เย็น ใช้เวลาประมาณ 5 - 10 นาที แล้วนำไก่ขึ้นพักให้สะเด็ดน้ำ ทาด้วยน้ำมันพืชบาง ๆ ให้ทั่วชิ้นไก่ พักไว้",
                    "น้ำซุปที่ต้มไก่ให้ช้อนมันออกจากน้ำซุป เอาออกจนน้ำซุปใส ใส่ฟักที่หั่นแล้วลงไปต้ม ปรุงรสด้วยซีอิ๊ว และเกลือ ต้มจนฟักสุก",
                    "หุงข้าวมันไก่ โดยเจียวกระเทียมกับขิงแก่บุบจนหอม ใส่ข้าวสารดิบลงไป ผัดพอเข้ากัน ปรุงรสด้วยเกลือ น้ำมันไก่ที่ช้อนไว้ ผัดอีกรอบแล้วเทใส่หม้อหุงข้าว ใส่น้ำซุปต้มไก่ลงไป หุงจนข้าวสุก",
                ],
            },
            {
                id_menu: 1002,
                id_create:1,
                name: "ห่อหมก",
                meat: "Fish",
                category: "Thai",
                method: "Steamed Food",
                is_favorite: false,
                select_show: false,
                image: "img-food/ห่อหมก.webp",
                material: [
                    "เนื้อปลาช่อน 500 กรัม",
                    "เนื้อปลากรายขูด 500 กรัม",
                    "ไข่ไก่ 1 ฟอง",
                    "พริกแกงเผ็ด 150 กรัม",
                    "กะทิถุงพาสเจอร์ไรส์ 800 กรัม",
                    "น้ำปลา 3 ช้อนโต๊ะ",
                    "น้ำตาลปี๊บ 1 1/2 ช้อนโต๊ะ",
                    "ใบยอ 50 กรัม",
                    "ใบโหระพา 10 กรัม",
                    "ใบมะกรูด 2 กรัม",
                    "พริกชี้ฟ้าแดง 20 กรัม",
                ],
                methods: [
                    "ทำถ้วยใบตองสำหรับใส่ห่อหมก/ ซื้อ",
                    "นำใบยอ ใบมะกรูด พริกชี้ฟ้าแดง มาซอย พักไว้ จากนั้นนำปลาช่อนมาแร่เป็นชิ้นบางๆ พักไว",
                    "เตรียมภาชนะสำหรับผสมเครื่อง ใส่เนื้อปลากรายขูด พริกแดงเผ็ด ไข่ไก่หนึ่งฟอง น้ำปลา น้ำตาลปี๊ป ใช้ไม้พายคลุกส่วนผสมทุกอย่างให้เข้ากันดี",
                    "เติมกะทิลงไป ค่อยๆ ใส่ทีละนิด คนจนทุกอย่างเข้ากันดี",
                    "ใส่เนื้อปลาช่อนที่แร่เป็นชิ้นไว้ลงไป คนให้เข้ากันอีกครั้ง พักไว",
                    "นำใบยอและใบโหระพาใส่ในถ้วยใบตองที่เราเตรียมไว้ เทห่อหมกลงไป ใช้ไฟแรงในการนึ่ง 12 นาที",
                    "เตรียมกะทิสำราดด้านบน เทน้ำกะทิและแป้งข้าวจ้าวลงไปในหม้อ คนผสมให้เข้ากัน นะไปต้มให้สุก นำไปราดบนห่อหมกที่นึ่งจนสุกดีแล้ว",
                    "แต่งหน้าด้านบนด้วยใบมะกรูดและพริกชี้ฟ้าซอย เป็นอันเสร็จ",
                ],
            },
            {
                id_menu: 1003,
                id_create:1,
                name: "ไก่ย่าง",
                meat: "Chicken",
                category: "Thai",
                method: "Grilled Food",
                is_favorite: false,
                select_show: false,
                image: "img-food/ไก่ย่าง.jpg",
                material: [
                    "ไก่ (ขนาดประมาณ 1 กิโลกรัม) 1 ตัว",
                    "ตะไคร้ 3 ต้น",
                    "กระเทียมไทย 20 กลีบ",
                    "รากผักชี 7 ราก",
                    "พริกไทยดำ 1 ช้อนโต๊ะ",
                    "ใบเตย 2 ใบ",
                    "ซอสหอยนางรม 2 ช้อนโต๊ะ",
                    "ซีอิ๊วขาว 1+1/2 ช้อนโต๊ะ",
                    "หอมแดง 4 หัว",
                    "นมสด 1/4 ถ้วย",
                    "เกลือ 1 ช้อนชา",
                ],
                methods: [
                    "เริ่มต้นโดยหั่นอกไก่ให้ขาดออกจากกันแล้วแบะออก",
                    "นำส่วนผสมน้ำซอสใส่ลงในโถปั่น ปั่นจนละเอียด เสร็จแล้วเอามาหมักกับตัวไก่อย่างน้อย 3 ชั่วโมง หรือข้ามคืน",
                    "พอครบเวลานำมาอบที่อุณหภูมิ 180 องศาฟาเรนไฮต์ ประมาณ 30 นาที ระหว่างอบให้ใช้น้ำมันทาที่หนังไก่ด้วยเพื่อให้ไก่เหลืองสวยงาม",
                    "พอสุกนำมาหั่นเป็นชิ้น เสิร์ฟพร้อมน้ำจิ้มไก่ย่าง",
                ],
            },
            {
                id_menu: 1004,
                id_create:1,
                name: "แกงเขียวหวาน",
                meat: "Chicken",
                category: "Thai",
                method: "boiled Food",
                is_favorite: false,
                select_show: false,
                image: "img-food/แกงเขียวหวาน.jpg",
                material: [
                    "เนื้อไก่ 300 กรัม",
                    "มะเขือเปาะ 4-5 ลูก",
                    "มะเขือพวง 1 กรัม",
                    "พริกชี้ฟ้าสีแดง 2-3 เม็ด",
                    "โหระพา 3 ต้น",
                    "ใบมะกรูด 5 ใบ",
                    "พริกแกงเขียวหวาน 3 ช้อนโต๊ะ",
                    "หัวกะทิ และหางกะทิอย่างละ 1 ถ้วย",
                    "น้ำตาลปี๊บ หรือน้ำตาลทราย 2 ช้อนโต๊ะ",
                    "น้ำปลา 2 ช้อนโต๊ะ",
                ],
                methods: [
                    "ล้างเนื้อไก่ให้สะอาดและหั่นพอดีคำ",
                    "ล้างมะเขือเปราะ ผ่าครึ่งหั่นเป็นชิ้นๆ และแช่น้ำเกลือไว้เพื่อป้องกันไม่ให้มีสำคล้ำ หรือดำ",
                    "เด็ดมะเขือพวง และใบโหระพา ล้างให้สะอาด",
                    "หั่นพริกชี้ฟ้าเฉียงๆ ให้เรียบร้อย",
                    "ตั้งกระทะใส่หัวกะทิเคี่ยวให้กะทิพอเดือดและแตกมันเล็กน้อย จากนั้นก็ใส่พริกแกงเขียวหวานลงไปผัดให้หอม พอผัดพริกแกงจนหอมได้ที่แล้วก็ใส่เนื้อไก่ลงไปผัดพอสุก จากนั้นก็เติมหางกะทิลงไป ปรุงรสด้วยน้ำปลาน้ำตาล คนให้เข้ากัน แล้วใส่มะเขือเปราะ มะเขือพวง ใบมะกรูด ที่เราเตรียมไว้ ใส่ลงไปพร้อมกันต้มต่อไปจนมะเขือเปราะสุก ถ้าชอบแกงเขียวหวานที่มะเขือเปราะพอสุกแล้วแต่ความชอบของแต่ละบุคคลค่ะ ต่อจากนั้นปิดไฟและใส่ใบโหระพา กับพริกชี้ฟ้าสีแดงลงไปคนให้เข้ากัน",
                ],
            },
            {
                id_menu: 1005,
                id_create:1,
                name: "สเต๊กไก่",
                meat: "Chicken",
                category: "Italian",
                method: "Grilled Food",
                is_favorite: false,
                select_show: false,
                image: "img-food/สเต็กไก่.jpg",
                material: [
                    "สะโพกไก่เลาะกระดูก 4 ชิ้น",
                    "ผงสไปซี่ 1 ช้อนตวง",
                    "ซอสพริก 2 ช้อนตวง",
                    "ซอสมะเขือเทศ 2 ช้อนตวง",
                    "ซีอิ๊วขาว 2 ช้อนชา",
                    "เกลือสมุทร 1/2 ช้อนชา",
                    "พริกไทยป่น 1/2 ช้อนชา",
                    "น้ำตาลทราย 1 ช้อนชา",
                    "เฟรนซ์ฟรายส์",
                    "ผักสลัด",
                    "ขนมปังปิ้ง",
                ],
                methods: [
                    "นำเนื้อไก่มาเลาะกระดูกออกก่อน นำมาล้างทำความสะอาดด้วยเกลือ และน้ำสะอาดหลายๆ น้ำ",
                    "จากนั้นนำไปหมักด้วย ซอสมะเขือเทศ ซอสพริก ซีอิ๊วขาว น้ำตาลทราย พริกไทยป่น เกลือสมุทร และผงสไปซี่",
                    "คลุกเคล้าให้ส่วนผสมเข้ากันดี แรปด้วยฟิล์มถนอมอาหาร และนำไปแช่ในตู้เย็นอย่างน้อย 1 ชั่วโมง",
                    "จากนั้นนำไปย่างในหม้อทอดไร้น้ำมัน อบในหม้ออบลมร้อน หรือย่างบนกระทะก็ได้ตามสะดวก",
                    "นำเข้าหมอทอดไร้น้ำมันด้วยอุณหภูมิ 170 องศา ด้านละ 10 นาที รวม 20 นาที",
                    "นำออกมาหั่นเป็นชิ้นพอดีคำ พร้อมเสิร์ฟ",
                ],
            },
            {
                id_menu: 1006,
                id_create:1,
                name: "มาม่าขี้เมาเบคอน",
                meat: "Pork",
                category: "Thai",
                method: "Stirred Food",
                is_favorite: false,
                select_show: false,
                image: "img-food/มาม่าขี้เมาเบคอน.jpg",
                material: [
                    "เส้นบะหมี่กึ่งสำเร็จรูป 150 กรัม ",
                    "เบคอน ตามชอบ",
                    "กระเทียม 15 กลีบ",
                    "พริกขี้หนูแห้ง 1/2 ถ้วย",
                    "เกลือ 1/2 ช้อนชา (สำหรับผัด)",
                    "พริกไทย 2 ช้อนชา",
                    "น้ำตาล 1/2 ช้อนโต๊ะ",
                    "ออริกาโน่ 1 ช้อนชา",
                    "น้ำมัน 2 ช้อนโต๊ะ",
                ],
                methods: [
                    "ต้มเส้นบะหมี่กึ่งสำเร็จรูป เวลาตามหน้าซอง",
                    "ตั้งกระทะใช้ไฟอ่อน ทอดเบคอนให้ได้ความกรอบตามชอบ",
                    "นำน้ำมันออก ให้เหลือประมาณ 2 ช้อนโต๊ะ ใช้ไฟปานกลาง ใส่กระเทียมลงไป",
                    "ใส่เส้นลงไป ปรุงรสด้วยเกลือ พริกไทย และน้ำตาล โรยออริกาโน่ และพริกแห้งหั่นท่อนลงไป คลุกเคล้าพอเข้ากัน",
                    "ใส่เบคอนลงไป ผัดให้เข้ากัน",
                ],
            },
            {
                id_menu: 1007,
                id_create:1,
                name: "พิซซ่า",
                meat: "Other Meat",
                category: "Italian",
                method: "Baked Food",
                is_favorite: false,
                select_show: false,
                image: "img-food/พิซซ่า.webp",
                material: [
                    "แป้งพิซซ่าสำเร็จรูป 1-2 แผ่น",
                    "เนย 1 ช้อนโต๊ะ",
                    "กระเทียมสับ 8 กลีบ",
                    "แป้งอเนกประสงค์ 2 ช้อนโต๊ะ",
                    "พริกไทย 1/2 ช้อนชา",
                    "นม 1/2 ถ้วย",
                    "วิปปิ้งครีม 1/4 ถ้วย",
                    "พาเมซานชีส 1/4 ถ้วย",
                    "มอซซาเรลล่าชีส 1 1/2 ถ้วย",
                    "เห็ดฟางหรือแชมปิญองสไลด์ 1 ถ้วย",
                    "แฮมหั่น 6 แผ่น",
                    "โหระพา สำหรับตกแต่ง",
                ],
                methods: [
                    "เปิดเตา ตั้งอุณหภูมิที่ 450 องศาฟาเรนไฮต์",
                    "ตั้งกระทะใส่เนยเล็กน้อย พอเริ่มละลาย ใส่เห็ดลงไปผัดให้สุก แล้วตักขึ้นพักไว้",
                    "ตั้งกระทะอีกครั้ง ใส่เนยและกระเทียม ผัดจนหอม",
                    "ใส่แป้งอเนกประสงค์ลงไปแล้วคนไปด้วย เพื่อไม่ให้เป็นก้อน",
                    "เติมนมและวิปปิ้งครีมลงไป คนจนครีมเริ่มข้น แล้วโรยด้วยพริกไทย",
                    "เมื่อซอสข้นได้ที่แล้ว ยกลงใส่พาเมซานชีสลงไป ผสมให้เข้ากัน",
                    "ทาซอสลงบนแป้งพิซซ่าให้ทั่ว ตกแต่งด้วยเห็ด แฮม และมอซซาเรลล่าชีส",
                    "นำเข้าเตาอบ ประมาณ 15-20 นาที หรือจนแป้งเหลืองกรอบ นำออกมาตกแต่งด้วยใบโหระพา",
                ],
            },
            //---------------------------------------------------------------------------เพิ่ม
            {
                id_menu: 1008,
                id_create:1,
                name: "ทำแป้งซาลาเปา",
                meat: "Other Meat",
                category: "Chinese",
                method: "Steamed Food",
                is_favorite: false,
                select_show: false,
                image: "img-food/แป้งซาลาเปา.jpg",
                material: [
                    "แป้งเค้ก 350 กรัม[แป้งเชื้อ]",
                    "ยีสต์ 1 ช้อนโต๊ะ[แป้งเชื้อ]",
                    "น้ำเปล่า 240 กรัม[แป้งเชื้อ]",
                    "แป้งเค้ก 180 กรัม",
                    "ผงฟู 1 1/2 ช้อนชา",
                    "แป้งเชื้อที่ผสมไว้",
                    "น้ำตาลทราย 125 กรัม",
                    "เกลือป่น 1/2 ช้อนชา",
                    "น้ำเปล่า 4 ช้อนชา",
                    "เนยขาว 40 กรัม",
                ],
                methods: [
                    "ร่อนแป้งเค้ก 2 รอบแล้วใส่ลงในอ่างผสม ใส่ยีสต์ตามลงไปคนให้ผสมเข้ากัน [แป้งเชื้อ]",
                    "ทำหลุมแป้งตรงกลางแล้วค่อย ๆ เทน้ำเปล่าลงไป ใช้หัวตีรูปตะขอนวดแป้งจนส่วนผสมเริ่มเป็นก้อน [แป้งเชื้อ]",
                    "นำส่วนผสมแป้งใส่ภาชนะแล้วคลุมด้วยพลาสติกถนอมอาหารหรือผ้าขาวบาง พักแป้งไว้ประมาณ 30-40 นาทีจนแป้งขึ้นฟูเป็นสองเท่า [แป้งเชื้อ]",
                    "ร่อนแป้งเค้กกับผงฟูเข้าด้วยกัน 2 รอบ เตรียมไว้",
                    "ใส่แป้งเชื้อที่ขึ้นฟูแล้วลงในเครื่องตีแป้ง ตามด้วยน้ำตาลทราย เกลือป่น และน้ำเปล่า ตีด้วยหัวตีรูปตะขอใช้ความเร็วปานกลางนวดแป้งพอเข้ากัน",
                    "ค่อย ๆ ใส่ส่วนผสมแป้งที่ร่อนไว้ลงไป ตีจนพอจับตัวเป็นก้อน",
                    "ใส่เนยขาวลงไปนวดจนแป้งมีเนื้อเนียนและนุ่ม",
                    "นำก้อนแป้งออกมาคลึงเป็นก้อนกลม ใส่ภาชนะแล้วใช้พลาสติกถนอมอาหารคลุมแป้งพักไว้ประมาณ 5-10 นาที",
                ],
            },
            {
                id_menu: 1009,
                id_create:1,
                name: "ซาลาเปาไส้หมูสับ",
                meat: "Pork",
                category: "Chinese",
                method: "Steamed Food",
                is_favorite: false,
                select_show: false,
                image: "img-food/ซาลาเปาไส้หมูสับ.jpg",
                material: [
                    "แป้งซาลาเปา",
                    "รากผักชี 1 ช้อนโต๊ะ",
                    "กระเทียมสับ 1 ช้อนโต๊ะ",
                    "พริกไทยป่น 2 ช้อนชา",
                    "เนื้อหมูบด (หรือเนื้อไก่บด) 500  กรัม",
                    "แป้งข้าวโพด 3 ช้อนโต๊ะ",
                    "หอมใหญ่สับ 150 กรัม",
                    "ซอสหอยนางรม 1 ช้อนโต๊ะ",
                    "ซอสปรุงรส 2 ช้อนโต๊ะ",
                    "น้ำตาลทราย 2 ช้อนชา",
                    "น้ำมันงา 1 ช้อนโต๊ะ",
                    "กระดาษสำหรับรองซาลาเปา",
                ],
                methods: [
                    "เตรียมส่วนผสมแป้งให้พร้อม",
                    "โขลกรากผักชี กระเทียมสับ และพริกไทยป่นให้ละเอียด ใส่หมูสับและแป้งข้าวโพดลงไปแล้วนวดจนเหนียวเป็นเนื้อเดียวกัน",
                    "ปรุงรสด้วยซอสหอยนางรม ซอสปรุงรส น้ำตาลทราย และน้ำมันงา คนผสมจนเข้ากันดี เตรียมไว้",
                    "แผ่แป้งซาลาเปาที่พักไว้จนขึ้นฟูแล้วให้เป็นแผ่นบาง วางไส้หมูสับแล้วห่อให้สวยงาม วางบนกระดาษ พักแป้งให้ขึ้นฟูสักครู่",
                    "วางเรียงซาลาเปาที่ขึ้นฟูแล้วลงในชุดนึ่งแล้วนำไปนึ่งโดยใช้ไฟแรงนานประมาณ 8-10 นาที นำออกจากเตา พร้อมเสิร์ฟ",
                ],
            },
            {
                id_menu: 1010,
                id_create:1,
                name: "ซาลาเปาไส้ครีม",
                meat: "Other Meat",
                category: "Chinese",
                method: "Steamed Food",
                is_favorite: false,
                select_show: false,
                image: "img-food/ซาลาเปาไส้ครีม.jpg",
                material: [
                    "แป้งซาลาเปา",
                    "ผงคัสตาร์ดสำเร็จรูป 225 กรัม",
                    "น้ำตาลไอซิ่ง 50 กรัม",
                    "นมสดแช่เย็นจัด 1+1/2 ถ้วยตวง",
                    "เนยสดเค็มละลาย 50 กรัม",
                    "พลาสติกถนอมอาหาร (สำหรับคลุมแป้ง)",
                    "กระดาษสำหรับรองซาลาเปา",
                ],
                methods: [
                    "เตรียมส่วนผสมแป้งให้พร้อม",
                    "ตีผสมผงคัสตาร์ดกับน้ำตาลไอซิ่ง และนมสดเข้าด้วยกันในเครื่องตีแป้ง ใช้หัวตีรูปตะกร้อดีด้วยความเร็วสูงสุดจนส่วนผสมเหนียวข้น จากนั้นเติมเนยสดละลายลงไปตีต่อจนส่วนผสมเป็นเนื้อเนียนเข้ากันดี ตักใส่ภาชนะ เตรียมไว้",
                    "แผ่แป้งซาลาเปาที่ขึ้นฟูแล้วให้เป็นแผ่นบาง ตักไส้ครีมลงไปแล้วห่อให้สวยงาม วางบนกระดาษ พักให้แป้งฟูขึ้นสักครู่",
                    "นำซาลาเปาขไปนึ่งบนน้ำเดือดโดยใช้ไฟปานกลางประมาณ 8-10 นาทีจนสุกยกลง นำออกจากที่นึ่ง จัดเสิร์ฟ",
                ],
            },
            {
                id_menu: 1011,
                id_create:1,
                name: "ซุปกิมจิ",
                meat: "Pork",
                category: "Korean",
                method: "Boiled Food",
                is_favorite: false,
                select_show: false,
                image: "img-food/ซุปกิมจิ.jpg",
                material: [
                    "กิมจิ 2 ถ้วยตวง",
                    "น้ำ 2 ถ้วยตวง",
                    "สันคอหมู 150 กรัม",
                    "เต้าหู้ขาวแข็ง 1 ก้อน",
                    "หอมหัวใหญ่ ½ หัว",
                    "ต้นหอมญี่ปุ่น 1 ต้น",
                    "ต้มหอม 2 ต้น",
                    "ซอสโคชูจัง 2 ช้อนโต๊ะ",
                    "พริกเกาหลี 2 ช้อนโต๊ะ",
                    "น้ำตาลทราย 1 ช้อนโต๊ะ",
                ],
                methods: [
                    "หั่นสันคอหมูเป็นชิ้นพอดีคำ หั่นกิมจิเป็นท่อน ๆ เตรียมไว้",
                    "นำหอมหัวใหญ่ และสันคอหมูลงไปผัด เมื่อหมูเริ่มสุก ให้ใส่กิมจิลงไปผัดต่อสักครู่ เทน้ำลงไป ใส่ต้นหอมญี่ปุ่น ตั้งไฟจนเดือด ต้ม 30 นาที",
                    "เมื่อครบ 30 นาที ใส่เต้าหู้ขาว แล้วต้มต่ออีก 5 นาที ตักใส่ชาม จัดเสิร์ฟ พร้อมโรยด้วยต้นหอม",
                ],
            },
            {
                id_menu: 1012,
                id_create:1,
                name: "ข้าวยำเกาหลี หรือ บิบิมบับ",
                meat: "Pork",
                category: "Korean",
                method: "Stirred Food",
                is_favorite: false,
                select_show: false,
                image: "img-food/ข้าวยำเกาหลี.jpg",
                material: [
                    "ซอสโคชูจัง 2 ช้อนโต๊ะ",
                    "ข้าวญี่ปุ่น 1 ถ้วย",
                    "พริกไทย 1 ช้อนชา",
                    "ซอสปรุงรส 1 ช้อนโต๊ะ",
                    "น้ำมันงา 1 ช้อนโต๊ะ",
                    "ผักโขม 100 กรัม",
                    "เห็ดหอม 100 กรัม",
                    "ถั่วงอก 100 กรัม",
                    "เห็ดเข็มทอง 100 กรัม",
                    "แตงกวา 100 กรัม",
                    "แครอท 100 กรัม",
                    "น้ำตาล 1 ช้อนโต๊ะ",
                    "น้ำส้มสายชู 1/4 ถ้วย",
                    "ไข่ไก่ 1 ฟอง",
                    "กิมจิ 100 กรัม",
                    "น้ำมันงา 2 ช้อนโต๊ะ สำหรับผัด",
                ],
                methods: [
                    "ใส่หมูสไลซ์ลงในชามผสม ตามด้วยพริกไทย ซอสปรุงรส และน้ำมันงา สำหรับหมัก คลุกเคล้าให้เข้ากัน และหมักไว้ 30 นาที",
                    "นำน้ำตาล ผสมกับน้ำส้มสายชู คนให้เข้ากันจนน้ำตาลละลาย และราดลงบนผักทั้งหมด ได้แก่ ผักโขม เห็ดหอม ถั่วงอก เห็ดเข็มทอง แตงกวา และแครอท",
                    "นำกระทะขึ้นตั้งไฟปานกลาง และนำหมูสไลซ์ที่หมักไว้ไปผัดจนสุก",
                    "นำกระทะขึ้นตั้งไฟปานกลาง เทน้ำมันงาลงไปนิดหน่อย จากนั้น นำผักไปผัดทีละอย่าง",
                    "นำชามหินสไตล์เกาหลีขึ้นตั้งไฟแรงให้ชามร้อนทั่ว",
                    "นำของที่ผัดเตรียมไว้มาเรียงใส่ชาม ได้แก่ ข้าวญี่ปุ่น ผักโขม เห็ดหอม ถั่วงอก เห็ดเข็มทอง แตงกวา แครอท และหมูสไลซ์ จัดวางกิมจิ และโคชูจังลงไป ท้ายสุดตอกไข่ไก่ใส่ลงตรงกลาง",
                    "จัดเสิร์ฟ เวลาทาน คลุกเคล้าให้เข้ากันในชามร้อน ๆ ",
                ],
            },
            {
                id_menu: 1013,
                id_create:1,
                name: "ซุปมิโซะ",
                meat: "Fish",
                category: "Japanese",
                method: "Boiled Food",
                is_favorite: false,
                select_show: false,
                image: "img-food/ซุปมิโซะ.jpg",
                material: [
                    "น้ำสะอาด 2 ลิตร",
                    "เต้าเจี้ยวญี่ปุ่น 3-4 ช้อนโต๊ะ",
                    "เต้าหู้ญี่ปุ่น แบบนิ่ม 1 ก้อน",
                    "สาหร่ายสด 100 กรัม (วากาเบะ)",
                    "ปลาโอแห้ง 2 ช้อนโต๊ะ (หรือ ผงปลาดาชิ)",
                    "ต้นหอมซอย 1/2 ถ้วย",
                ],
                methods: [
                    "เตรียมเต้าหู้ขาวญี่ปุ่น หั่นเป็นชิ้นสี่เหลี่ยมลูกเต๋าเล็กๆ เตรียมไว้ก่อน",
                    "ต้มน้ำให้เดือด ใส่ปลาโอแห้ง หรือผงปลาดาชิ ลงไป ใส่เต้าหู้ญี่ปุ่นที่หั่นไว้ลงไป ใส่สาหร่ายวากาเบะ ต้มให้เดือด",
                    "ตักน้ำที่เดือดใส่ถ้วย ตักเต้าเจี้ยวญี่ปุ่นใส่ลงในถ้วยคนให้เต้าเจี้ยวญี่ปุ่นให้ละลาย เทกลับใส่หม้อ คนพอเข้ากัน ก็ปิดไฟได้เลย",
                    "ตักซุปมิโซะใส่ถ้วย โรยต้นหอมซอยลงไป แค่นี้ก็จะได้มิโซะซุป อร่อย ง่ายๆ แล้ว",
                ],
            },
            {
                id_menu: 1014,
                id_create:1,
                name: "ไข่หวานญี่ปุ่น",
                meat: "Other Meat",
                category: "Japanese",
                method: "Fried Food",
                is_favorite: false,
                select_show: false,
                image: "img-food/ไข่หวานญี่ปุ่น.jpg",
                material: [
                    "ไข่ไก่  6 ฟอง",
                    "มิริน 1/2 ถ้วย",
                    "ซอสญี่ปุ่น 1 ช้อนโต๊ะ",
                    "น้ำสะอาด 1/2 ถ้วย",
                    "น้ำมันพืช 2 ช้อนชา",
                    "น้ำตาลทราย 3 ช้อนโต๊ะ",
                ],
                methods: [
                    "เริ่มจากการตอกไข่ใส่ถ้วย ตีไข่ให้พอแตก ใส่ซอสญี่ปุ่น มิริน น้ำตาลทราย น้ำสะอาดคนให้เข้ากันดี",
                    "นำมากรองด้วยตะแกรงเพื่อให้ไข่เนียนดี",
                    "ตั้งกระทะใช้ไฟอ่อนๆ ใช้เป็นกระทะเทปล่อนเพื่อความสะดวก นำน้ำมันพืชเช็ดให้ทั่วกระทะ",
                    "จากนั้นยกกระทะขึ้นจากเตา ตักไข่ใส่ลงไปพอเป็นแผ่นบางๆ ทั่วกระทะ หมุ่นกระทะไปมาเพื่อให้ไข่สม่ำเสมอกัน เวลาสุกจะได้พร้อมกัน",
                    "พอไข่เริ่มเซ็ตตัวดีใช้พายปาดขอบด้านข้าง ค่อยๆ ม้วนไข่หวานจนเกือบสุดขอบกระทะ จากนั้นใช้พายช่วยประคองไข่ม้วน ให้ถอยหลังมาจุดเริ่มต้น",
                    "เช็ดกระทะด้วยน้ำมัน ให้กระทะสะอาด ตักไข่ใส่ลงไป รอไข่เซ็ตตัวแล้วม้วนต่อจนจบ ทำแบบนี้จนไข่หมดหรือได้ความหนาตามต้องการ",
                    "พอม้วนไข่ได้ความหน่าตามต้องการแล้ว ให้พักไว้บนเตา ตะแครงไปมาให้ครบทุกด้านเพื่อจัดทรงให้เป็นสิ้นสี่เหลี่ยม และให้ไข่หวานแน่นดี",
                    "พอได้แล้วตักพักไว้บนกระดาษซับมัน ซับมันออกนิดหน่อย นำมาหั่นเป็นชิ้นๆ จัดใส่จานเตรียมเสิร์ฟได้เลย",
                ],
            },
            {
                id_menu: 1015,
                id_create:1,
                name: "ข้าวหมกไก่",
                meat: "Chicken",
                category: "Indian",
                method: "Cook Food",
                is_favorite: false,
                select_show: false,
                image: "img-food/ข้าวหมกไก่.webp",
                material: [
                    "น่องไก่ติดสะโพก 4 ชิ้น [หมักไก่]",
                    "ผงข้าวหมก [หมักไก่]",
                    "นมเปรี้ยว 1 ถ้วยตวง (125 กรัม) [หมักไก่]",
                    "เนยแขก (Ghee) หรือเนยถังทอง 2 ช้อนโต๊ะ [หมักไก่]",
                    "หอมแดงสับ 15 หัว [หมักไก่]",
                    "กระเทียมสับ 10 กลีบ [หมักไก่]",
                    "ขิงสับละเอียด 1 ช้อนโต๊ะ [หมักไก่]",
                    "ข้าวหอมมะลิ 2 ถ้วย",
                    "น้ำซุปไก่ 1 ถ้วย",
                    "ผงกะหรี่ 1 ช้อนชา",
                    "หญ้าฝรั่น 1 ช้อนชา",
                    "ผงขมิ้น 1 ช้อนชา",
                    "ลูกผักชีป่น 1 ช้อนชา",
                    "ยี่หร่าป่น 1 ช้อนโต๊ะ",
                    "พริกไทยป่น 1 ช้อนชา",
                    "เกลือป่น 1 ช้อนชา",
                    "อบเชย 1 ช้อนชา",
                    "ใบกระวาน 2 ใบ",
                    "น้ำตาลทราย 1 ช้อนโต๊ะ",
                    "ลูกกระวาน 3-4 ลูก ถ้ามีลูกกระวานเทศ (ลูกเฮ้นท์) ก็ใส่ไป [ใส่/ไม่ใส่ก็ได้]",
                    "กานพลู 3-4 ดอก [ใส่/ไม่ใส่ก็ได้]",
                    "ไม้หวาน (อบเชย) หักเป็นท่อนเล็ก ๆ 2-3 ท่อน [ใส่/ไม่ใส่ก็ได้]",
                    "โป๊ยกั๊ก 2 ดอก [ใส่/ไม่ใส่ก็ได้]",
                ],
                methods: [
                    "ใช้ส้อมจิ้มสะโพกไก่ให้เป็นรูพรุน ใส่ผงข้าวหมกและนมเปรี้ยว คลุกเคล้าให้ทั่วแล้วหมักทิ้งไว้ในตู้เย็นข้ามคืน เตรียมไว้ (ก่อนนำไก่มาใช้ นำเนื้อไก่ออกมาคลุกเคล้าอีกรอบแล้วทิ้งไว้ให้คลายความเย็น)",
                    "ตั้งกระทะบนเตา ใส่เนยแขกลงไป ตามด้วยหอมแดง กระเทียม และขิงสับละเอียดลงไปผัดให้หอมแดงสุกใส ใส่เนื้อไก่หมักลงไปจี่ในเครื่องแกง พอชิ้นไก่เริ่มเกรียมเล็กน้อย กลับด้าน ทอดแบบไม่ต้องสุกมาก ตักใส่ชาม เตรียมไว้",
                    "ซาวข้าวสารให้สะอาด ตักขึ้นสะเด็ดน้ำ เตรียมไว้",
                    "ผัดเครื่องแกงในกระทะ จากนั้นนำข้าวสารที่ซาวแล้วลงผัด คลุกเคล้าให้เข้ากันจนทั่ว ยกลงจากเตา",
                    "ใส่ข้าวหมกลงหม้อหุงข้าว วางชิ้นไก่บนข้าว (หรือวางเรียงสลับกัน) เติมน้ำซุปไก่ลงไป",
                    "ตั้งโปรแกรมหุงข้าวธรรมดา ก่อนที่ข้าวจะสุกให้ใช้พายไม้หรือพายยางคนข้าวจากด้านล่างขึ้นมาด้านบน วิธีนี้จะทำให้ข้าวสุกทั่ว มีปัญหาข้าวดิบเนื่องจากน้ำซุปที่ใส่ไปอาจจะไม่ท่วมข้าวด้านบน ทำให้ส่วนบนไม่สุกทั่ว ถ้าข้าวไม่เหลืองให้เติมหญ้าฝรั่นลงไปเพื่อเพิ่มความเหลือง ไม่ใช่เหลืองของหญ้าฝรั่น แต่เป็นเหลืองของผงขมิ้นและผงกะหรี่",
                    "ตักข้าวใส่จาน วางทับด้วยชิ้นไก่ โรยหน้าด้วยหอมเจียว จัดวางผักต่าง ๆ แตงกวา ต้นหอม ผักกาดหอม โรยหน้าด้วยผักชี ใบสะระแหน่สด เสิร์ฟพร้อมน้ำจิ้มสะระแหน่",
                ],
            },
            {
                id_menu: 1016,
                id_create:1,
                name: "ซาโมซ่าผัก",
                meat: "Other Meat",
                category: "Indian",
                method: "Puff Food",
                is_favorite: false,
                select_show: false,
                image: "img-food/ซาโมซ่าผัก.jpg",
                material: [
                    "เนยอินเดีย (Ghee) 2 ช้อนโต๊ะ",
                    "เมล็ดมัสตาร์ด 1/2 ช้อนชา",
                    "เมล็ดยี่หร่าแขก (Cumin) 1/2 ช้อนชา",
                    "หอมแดง (หั่นเต๋าเล็ก) 1/2 ลูก",
                    "พริกชี้ฟ้าสับละเอียด 1 เม็ด",
                    "กระเทียมสับละเอียด 1 หัว",
                    "ขิงขนาด 2 ซม.สับ 1 ชิ้น",
                    "ถั่วลันเตาแช่แข็ง 1/2 ถ้วย",
                    "มันฝรั่งหั่นเต๋าเล็ก 1 ลูก",
                    "ดอกกะหล่ำ 200 กรัม",
                    "แครอทหั่นเต๋าขนาดเล็ก 1 ลูก",
                    "ผงกะหรี่ 2 ช้อนชา",
                    "น้ำ 1/2 ถ้วย",
                    "น้ำมะนาว 1/2 ช้อนโต๊ะ",
                    "เกลือป่น 1 ช้อนชา",
                    "แผ่นแป้งเปาะเปี๊ยะสำเร็จรูป 250 กรัม",
                ],
                methods: [
                    "ผัดเนยอินเดียกับเมล็ดมัสตาร์ด และเมล็ดยี่หร่าแขกจนมีกลิ่นหอม ใส่หอมแดงลงผัดจนสุกนิ่ม ตามด้วยกระเทียม ขิง และพริกชี้ฟ้า ผัดผสมจนเข้ากัน นานประมาณ 2-3 นาที",
                    "ใส่ถั่วลันเตา มันฝรั่ง ดอกกะหล่ำ และแครอทลงผัดจนสุก และเข้ากันดี",
                    "เมื่อผักเริ่มสุกให้ใส่ผงกะหรี่ น้ำ และน้ำมะนาว ปรุงรสด้วยเกลือ ลดไฟอ่อน ผัดทุกอย่างให้สุกเข้ากันดี ตักใส่ถ้วย พักไว้",
                    "นำแผ่นแป้งเปาะเปี๊ยะมาตัดเป็น 3 ส่วนเท่า ๆ กัน ซ้อนแผ่นแป้งเปาะเปี๊ยะ 2 ชั้น ตักส่วนผสมไส้ (ประมาณ 2 ช้อนโต๊ะ) วางตรงส่วนปลายของแผ่นแป้ง ค่อย ๆ ขึ้นรูปเป็นทรงสามเหลี่ยม ม้วนแป้งขึ้นไปจนสุดปลายแผ่นแป้ง ปิดแผ่นแป้งด้วยน้ำเพื่อไม่ให้ไส้หลุดออกมา ทำจนครบ เตรียมไว้",
                    "เติมน้ำมันลงในกระทะ รอจนน้ำมันร้อนประมาณ 180 องศาเซลเซียส นำซาโมซ่าที่ทำเตรียมไว้ลงทอดจนแป้งมีสีเหลืองอมน้ำตาล ตักขึ้นสะเด็ดน้ำมัน จัดใส่จานเสิร์ฟขณะร้อน ๆ",
                ],
            },
            {
                id_menu: 1017,
                id_create:1,
                name: "สปาเก็ตตี้คาโบนาร่า",
                meat: "Pork",
                category: "Italian",
                method: "Puff Food",
                is_favorite: false,
                select_show: false,
                image: "img-food/สปาเก็ตตี้คาโบนาร่า.jpg",
                material: [
                    "เส้นสปาเก็ตตี้ 25 กรัม",
                    "ไข่ไก่ 2 ฟอง",
                    "พาร์เมซานชีส 3 ช้อนโต๊ะ",
                    "เบคอน ตามชอบ",
                    "เกลือ 1 ช้อนชา",
                ],
                methods: [
                    "ตั้งไฟ ใส่น้ำเปล่า รอจนน้ำเดือด",
                    "พอน้ำเดือด นำเส้นสปาเก็ตตี้ลงไปต้มได้เลยจ้า",
                    "ใส่เกลือ เพิ่มรสชาติให้เส้นสปาเก็ตตี้",
                    "ต้มประมาณ 12 นาที ให้เส้นสุกได้ที่ นำขึ้นแล้วพักไว้",
                    "ตั้งกระทะ นำเบคอนลงไปทอด ให้สุกกรอบ นำขึ้นพักไว้",
                    "แยกไข่ขาวกับไข่แดง",
                    "ใส่พาร์เมซานชีสลงไป",
                    "ตีพาร์เมซานชีสให้เข้ากันกับไข่แดง",
                    "นำเส้นสปาเก็ตตี้มาคลุกกับชีสและไข่แดงได้เลย",
                    "โรยด้วยเบคอนทอดกรอบด้านบน",
                ],
            },
            {
                id_menu: 1018,
                id_create:1,
                name: "ไก่นิวออลีนส์",
                meat: "Chicken",
                category: "Italian",
                method: "Fried Food",
                is_favorite: false,
                select_show: false,
                image: "img-food/ไก่นิวออลีนส์.jpg",
                material: [
                    "ปีกไก่ บน/ล่าง 1 กิโลกรัม",
                    "ซอสพริก 4 ช้อนโต๊ะ",
                    "ซอสหอยนางรม 3 ช้อนโต๊ะ",
                    "ซอมะเขือเทศ 4 ช้อนโต๊ะ",
                    "น้ำตาลปี๊บ 2 ช้อนโต๊ะ",
                    "ผงปรุงรสไก่ 2 ช้อนโต๊ะ",
                    "ผงปาปริก้า 1 ช้อนโต๊ะ",
                    "ผงกระเทียม 3 ช้อนโต๊ะ",
                    "น้ำตาล 2 ช้อนโต๊ะ",
                ],
                methods: [
                    "ล้างไก่ให้สะอาด จากนั้นใส่ซอสมะเขือเทศ",
                    "ตามด้วยซอสพริก ใส่ซอสหอยนางรม และผงปรุงรสไก่",
                    "ใส่น้ำตาล ผงกระเทียม ผงปาปริก้า และน้ำตาลปี๊บ",
                    "คลุกให้เข้ากัน",
                    "เอาเข้าหม้อทอดไร้น้ำมัน ใช้ไฟอุณหภูมิ 180 องศา เวลา 20 นาที",
                    "พร้อมเสิร์ฟ",
                ],
            },
            {
                id_menu: 1019,
                id_create:1,
                name: "เป็ดคั่วพริกเกลือ",
                meat: "Duck",
                category: "Chinese",
                method: "Puff Food",
                is_favorite: false,
                select_show: false,
                image: "img-food/เป็ดคั่วพริกเกลือ.jpg",
                material: [
                    "เป็ดพะโล้ 1 ตัว",
                    "น้ำมันพืช 1 1/2 ช้อนโต๊ะ",
                    "กระเทียมสับ 2 ช้อนโต๊ะ",
                    "พริกแห้งสับ",
                    "ผงปรุงรส 1 ช้อนชา",
                    "เกลือป่น 2 ช้อนชา",
                    "น้ำตาลทราย 1 ช้อนชา",
                ],
                methods: [
                    "เป็ดพะโล้สำเร็จที่ไหว้เจ้าเสร็จแล้ว นำมาหั่นเป็นชิ้นๆ",
                    "ใส่น้ำมันพืชเล็กน้อย จากนั้นก็ผัดกระเทียมและพริก ปริมาณตามความชอบ",
                    "นำเป็ดลงไปผัด ปรุงรสด้วยผงปรุงรส เกลือป่น และ น้ำตาลทราย ผัดจนเครื่องปรุงเข้าเนื้อดี จากนั้นก็ตักใส่จานเสิร์ฟเลย",
                ],
            },
            {
                id_menu: 1020,
                id_create:1,
                name: "เป็ดย่าง",
                meat: "Duck",
                category: "Chinese",
                method: "Grilled Food",
                is_favorite: false,
                select_show: false,
                image: "img-food/เป็ดย่าง.jpg",
                material: [
                    "น้ำมันหอย 1 ช้อนโต๊ะ [หมักเป็ด]",
                    "ซีอิ๊วขาว 1 ช้อนโต๊ะ [หมักเป็ด]",
                    "ซีอิ๊วดำ 1 ช้อนโต๊ะ [หมักเป็ด]",
                    "เหล้าจีน 1 ช้อนโต๊ะ [หมักเป็ด]",
                    "ผงพะโล้ 1 ช้อนโต๊ะ [หมักเป็ด]",
                    "น้ำตาลทราย 1.5 ช้อนโต๊ะ [หมักเป็ด]",
                    "รากผักชีกระเทียมพริกไทย 2 ช้อนโต๊ะ [หมักเป็ด]",
                    "ขิง 1/2 ถ้วย [หมักเป็ด]",
                    "ผักชี 1 ถ้วย [หมักเป็ด]",
                    "เป็ด 1 ตัว (3 กิโลกรัม)",
                    "สีผสมอาหาร สีแดงส้ม 1 ช้อนชา (แล้วแต่ชอบสีเข้มหรืออ่อน)",
                    "ซีอิ๊วขาว 1 ช้อนโต๊ะ",
                    "เกลือ 1 ช้อนโต๊ะ",
                    "น้ำผึ้ง 2 ช้อนโต๊ะ",
                    "น้ำส้มสายชู 3 ช้อนโต๊ะ",
                    "น้ำตาลทราย 4 ช้อนโต๊ะ",
                    "น้ำสะอาด 2 ลิตร",
                ],
                methods: [
                    "เริ่มจากการเตรียมเครื่องหมัก เตรียมชามผสม ใส่เหล้าจีน น้ำมันหอย ซีอิ๊วขาว ซีอิ๊วดำ ผงพะโล้ น้ำตาลทราย รากผักชีกระเทียมพริกไทย ผสมพอเข้ากัน ใส่ขิงสับ ใส่ใบผักชีลงไป ผสมพอเข้ากัน",
                    "นำเครื่องสมุนไพรที่ผสมไว้ ยัดใส่ท้องเป็ด โดยใช้มือล้วงคนให้ทั่วท้องเป็ด ใช้ไม้ปลายแหลมเย็บท้องเป็ด แล้วใช้ลวดมัดให้แน่น และมัดคอเป็ดด้วยลวดให้แน่น จากนั้นเตรียมที่ปั๊มลูกโป่งหรือปั๊มลม ต่อด้วยสายยาง ใส่ไปในคอเป็ด บริเวณหนังเป็ดค่ะ แล้วปั๊มลมเข้าไปใต้ผิวหนังเป็ด ให้หนังพองทั่วตัว เพื่อที่เวลานำไปอบ หรือย่าง หนังกับเนื้อจะแยกชั้น ทำให้หนังเป็ดกรอบดี",
                    "ต้มน้ำให้เดือด ใส่น้ำตาลทราย เกลือ น้ำส้มสายชู ซีอิ๊วขาว น้ำผึ้ง คนพอน้ำตาลละลาย ใส่สีผสมอาหารลงไป แล้วต้มต่อน้ำให้เดือด จากนั้นตักราดบนตัวเป็ดให้หนังตึงและให้ได้สีสวยตามชอบ ราดหลายๆ รอบได้ พอได้สีตามชอบแล้ว นำไปห้อยผึ่งลมไว้ให้แห้ง ประมาณ 1-2 ชั่วโมง",
                    "วอร์มเตาอบให้ร้อนใช้อุณหภูมิประมาณ 220-250 องศา ใช้ไฟบนล่าง อบประมาณ 1.30​ - 2​ ชั่วโมง หรือดูจนสุกกรอบดีตามชอบ",
                    "เป็ดย่างหนังกรอบสุกแล้ว หั่นเป็นชิ้นๆ จัดใส่จาน พร้อมเสิร์ฟ",
                ],
            },
            {
                id_menu: 1021,
                id_create:1,
                name: "บาร์บีคิวเนื้อ",
                meat: "Beef",
                category: "Italian",
                method: "Grilled Food",
                is_favorite: false,
                select_show: false,
                image: "img-food/บาร์บีคิวเนื้อ.jpg",
                material: [
                    "เนื้อ 400 กรัม [หมักเนื้อ]",
                    "น้ำมันมะกอก 5 ช้อนโต๊ะ [หมักเนื้อ]",
                    "โรสแมรี่สับ 1 ช้อนโต๊ะ [หมักเนื้อ]",
                    "เกลือ 1 ช้อนชา [หมักเนื้อ]",
                    "พริกไทยดำป่น 1 1/2  ช้อนโต๊ะ [หมักเนื้อ]",
                    "ซอสมะเขือเทศ 100 กรัม [ซอสบาร์บีคิว]",
                    "พริกป่น 1 ช้อนโต๊ะ [ซอสบาร์บีคิว]",
                    "น้ำตาลทราย 1 ช้อนโต๊ะ [ซอสบาร์บีคิว]",
                    "เกลือ 1/4 ช้อนชา [ซอสบาร์บีคิว]",
                    "น้ำส้มสายชู 1 ช้อนโต๊ะ [ซอสบาร์บีคิว]",
                    "ผงกระเทียม 1 ช้อนชา [ซอสบาร์บีคิว]",
                    "น้ำผึ้ง 1 ช้อนชา [ซอสบาร์บีคิว]",
                    "พริกไทยดำ 1/4 ช้อนชา [ซอสบาร์บีคิว]",
                    "เนื้อหมัก",
                    "พริกหวาน เขียว เหลือง แดง",
                    "สับปะรด",
                    "หอมใหญ่",
                    "มะเขือเทศราชินี",
                ],
                methods: [
                    "หั่นเนื้อออกเป็นชิ้นเล็ก ๆ ใส่ลงในชามผสม [หมักเนื้อ]",
                    "ใส่โรสแมรี่สับ เกลือ พริกไทยดำป่น น้ำมันมะกอก คลุกเคล้าส่วนผสมทุกอย่างให้เข้ากัน [หมักเนื้อ]",
                    "ใช้พลาสติกแรปปิดปากชามเอาไว้ นำไปหมักไว้ในตู้เย็น 1 – 2 ชั่วโมง [หมักเนื้อ]",
                    "ตั้งกระทะ ใส่ซอมะเขือเทศ พริกป่น น้ำตาลทราย เกลือ น้ำส้มสายชู ผงกระเทียม น้ำผึ้ง พริกไทยดำ เสร็จแล้ว เปิดเตา คนส่วนผสมทุกอย่างให้เข้ากัน [ซอสบาร์บีคิว]",
                    "เคี่ยวด้วยไฟอ่อน ให้ซอสงวดลง และมีความข้นเหนียว พองวดและข้นเหนียวดีแล้ว ให้ปิดเตา พักทิ้งไว้ให้เย็น [ซอสบาร์บีคิว]",
                    "หั่นพริกหวาน หอมใหญ่ สับปะรด เป็นชิ้นเล็ก ๆ ให้เรียบร้อย",
                    "นำไม้มาเสียบ เริ่มจาก พริกหวาน สับปะรด หอมใหญ่ เนื้อหมัก และมะเขือเทศ ปิดท้าย",
                    "นำขึ้นเตาย่าง ปิ้งให้เนื้อเริ่มสุก เสร็จแล้ว ใช้พู่กันทำอาหารจุ่มซอสบาร์บีคิวที่ทำไว้ ทาให้ทั่ว ปิ้งต่อจนทุกอย่างสุก เป็นอันเสร็จ",
                ],
            },
            {
                id_menu: 1022,
                id_create:1,
                name: "บาร์บีคิวกุ้ง",
                meat: "Shrimp",
                category: "Italian",
                method: "Grilled Food",
                is_favorite: false,
                select_show: false,
                image: "img-food/บาร์บีคิวกุ้ง.jpg",
                material: [
                    "ซอสมะเขือเทศ 150 กรัม [ซอสบาร์บีคิว]",
                    "ซอสพริก 100 กรัม [ซอสบาร์บีคิว]",
                    "น้ำตาลทรายแดง 5 ช้อนโต๊ะ [ซอสบาร์บีคิว]",
                    "ซอสหอยนางรม 3 ช้อนโต๊ะ [ซอสบาร์บีคิว]",
                    "ซีอิ๊วขาว 2 ช้อนโต๊ะ [ซอสบาร์บีคิว]",
                    "ผงปาปริก้า ตามชอบ [ซอสบาร์บีคิว]",
                    "ผงหม่าล่า ตามชอบ [ซอสบาร์บีคิว]",
                    "พริกไทยดำ ตามชอบ [ซอสบาร์บีคิว]",
                    "เนื้อกุ้ง",
                    "พริกหวาน เขียว เหลือง แดง",
                    "สับปะรด",
                    "หอมใหญ่",
                    "มะเขือเทศราชินี",
                ],
                methods: [
                    "เตรียมชามผสม ใส่ซอมะเขือเทศ ซอสพริก น้ำตาลทรายแดง ซอสหอยนางรม ซีอิ๊วขาว ผงปาปริก้า ผงหม่าล่า พริกไทยดำ เสร็จแล้ว คนส่วนผสมทุกอย่างให้เข้ากัน",
                    "หั่นพริกหวาน หอมใหญ่ สับปะรด เป็นชิ้นเล็ก ๆ ให้เรียบร้อย",
                    "นำไม้มาเสียบ เริ่มจาก พริกหวาน สับปะรด หอมใหญ่ เนื้อกุ้ง และมะเขือเทศ ปิดท้าย",
                    "นำขึ้นเตาย่าง ปิ้งให้เนื้อกุ้งเริ่มสุก เสร็จแล้ว ใช้พู่กันทำอาหารจุ่มซอสบาร์บีคิวที่ทำไว้ ทาให้ทั่ว ปิ้งต่อจนทุกอย่างสุก เป็นอันเสร็จ",
                ],
            },
            {
                id_menu: 1023,
                id_create:1,
                name: "แกงแกะ",
                meat: "Mutton",
                category: "Indian",
                method: "Boiled Food",
                is_favorite: false,
                select_show: false,
                image: "img-food/แกงแกะ.jpg",
                material: [
                    "เนื้อแกะ 1 ปอนด์ (450 กรัม)",
                    "ขิงและกระเทียม 3 ช้อนโต๊ะ",
                    "มะเขือเทศ 3 ลูก",
                    "ผงกะหรี่ 2 ช้อนโต๊ะ",
                    "เมล็ดยี่หร่า 1 ช้อนโต๊ะ",
                    "ผักชี 2 ออนซ์ (50g)",
                    "กะทิ 150 มิลลิลิตร",
                    "น้ำมันพืช 120 มล.",
                    "ผักชีสำหรับโรยหน้า",
                    "หัวหอม 2 ลูก",
                    "2 ออนซ์ (50g) มะเขือเทศบด",
                    "1/4 ช้อนโต๊ะ garam masala",
                    "พริกป่น 1 ช้อนโต๊ะ",
                    "ขมิ้น 1 ช้อนโต๊ะ",
                    "มันฝรั่ง 5 หัว",
                    "เกลือ 1 ช้อนโต๊ะ",
                    "2 ช้อนโต๊ะ AJI-NO-MOTO",
                ],
                methods: [
                    "เจียวหัวหอมขิงและกระเทียมกับน้ำมันปรุงอาหาร",
                    "ใส่เมล็ดยี่หร่ามะเขือเทศน้ำซุปข้นมะเขือเทศและเนื้อแกะไหล่",
                    "ใส่ผงกะหรี่พริกป่นขมิ้นและการัมมาซาลา",
                    "เทกะทิ",
                    "ปรุงรสด้วยเกลือและ AJI-NO-MOTO",
                    "ใส่มันฝรั่งและผักชี",
                    "เคี่ยวด้วยไฟอ่อนประมาณ 40 นาที",
                    "โรยหน้าด้วยผักชี",
                ],
            },
            {
                id_menu: 1024,
                id_create:1,
                name: "ปลากะพงทอดน้ำปลา",
                meat: "Fish",
                category: "Italian",
                method: "Thai Food",
                is_favorite: false,
                select_show: false,
                image: "img-food/ปลากะพงทอดน้ำปลา.jpg",
                material: [
                    "ปลากระพงขาว  1  ตัว (1 กิโลกรัม)",
                    "น้ำตาลปี๊บ  2  ช้อนโต๊ะ",
                    "น้ำปลาแท้  2  ช้อนโต๊ะ",
                    "น้ำเปล่า  3  ช้อนโต๊ะ",
                    "น้ำมะนาว  2 1/2  ช้อนโต๊ะ [ส่วนผสมยำมะม่วง]",
                    "น้ำปลา  2 1/2  ช้อนโต๊ะ [ส่วนผสมยำมะม่วง]",
                    "น้ำตาลปี๊บ  1  ช้อนโต๊ะ [ส่วนผสมยำมะม่วง]",
                    "มะม่วงเปรี้ยว  50  กรัม [ส่วนผสมยำมะม่วง]",
                    "หอมแดง  20  กรัม [ส่วนผสมยำมะม่วง]",
                    "ขึ้นช่าย  5  กรัม [ส่วนผสมยำมะม่วง]",
                    "พริกแดงจินดา+พริกขี้หนู  20  กรัม [ส่วนผสมยำมะม่วง]",
                    "เม็ดมะม่วงหิมพานต์  50  กรัม [ส่วนผสมยำมะม่วง]",
                ],
                methods: [
                    "นำปลากระพงที่ซื้อมาล้างทำความสะอาด จากนั้นใช้ทิชชูอเนกประสงค์มาซับน้ำออกจากตัวปลาให้หมาด",
                    "ตั้งน้ำมันในกระทะจนน้ำมันร้อนจัด จากนั้นค่อยๆ ใส่ปลาลงไปทอด ปล่อยทิ้งไว้สักครู่ให้เนื้อปลาเซ้ตตัว อย่าเพิ่งขยับตัวปลา",
                    "เมื่อปลาด้านแรกสุกเหลืองดี (ประมาณ 6-7 นาที) แล้วค่อยพลิกทอดด้านที่สองต่ออีกประมาณ 3-4 นาที",
                    "จากนั้นนำปลาขึ้นมาหักสะเด็ดน้ำมัน",
                    "นำเม็ดมะม่วงหิมพานต์ลงมาทอดต่อในน้ำมันจนสุกเหลือง",
                    "นำน้ำตาลปี๊บใส่ลงในกระทะ ตามด้วยน้ำปลา และน้ำเปล่า [น้ำปลา]",
                    "เปิดเตาใช้ไฟกลางค่อนอ่อน คนจนน้ำตาลละลายดี [น้ำปลา]",
                    "เมื่อน้ำตาลปี๊บละลายดี ผัดจนน้ำงวดเข้าที่ และน้ำปลาหอมดี นำมาราดบนปลากระพงทอด พร้อมรับประทาน [น้ำปลา]",
                    "ใส่น้ำมะนาว น้ำปลา น้ำตาลปี๊บ แล้วผสมให้น้ำตาลละลายดี [ยำมะม่วง]",
                    "ขูดมะม่วงเปรี้ยวเตรียมไว้ จากนั้นใส่ขึ้นช่าย หอมแดง พริก และน้ำยำลงมาผสม โรยเม็ดมะม่วงหิมพานต์ เป็นอันเสร็จเรียบร้อย [ยำมะม่วง]",
                ],
            },
            {
                id_menu: 1025,
                id_create:1,
                name: "ปูผัดผงกะหรี่",
                meat: "Crab",
                category: "Thai",
                method: "Puff Food",
                is_favorite: false,
                select_show: false,
                image: "img-food/ปูผัดผงกะหรี่.jpg",
                material: [
                    "ปูเนื้อ 1 ตัว (สามารถใช้ปูเนื้อ ปูไข่ หรือปูม้าได้ตามต้องการ)",
                    "หอมหัวใหญ่ หั่นตามยาว 1/2 หัว",
                    "พริกชี้ฟ้าแดง หั่นแฉลบ 2 เม็ด",
                    "ต้นหอม หั่นท่อน 3 ต้น",
                    "คึ่นฉ่าย หั่นท่อน 2 ต้น",
                    "นมข้นจืด คาร์เนชัน 1 ถ้วยตวง",
                    "น้ำมันพืช 3 ช้อนโต๊ะ",
                    "ซีอิ๊วขาว 1 ช้อนโต๊ะ",
                    "น้ำตาลทราย 1 ช้อนชา",
                    "ผงกะหรี่ 4 ช้อนโต๊ะ",
                    "น้ำพริกเผาและน้ำมันพริกเผา 3 ช้อนโต๊ะ",
                    "ไข่ไก่ 2 ฟอง",
                    "พริกไทยป่น ตามชอบ",
                ],
                methods: [
                    "เตรียมปูเนื้อ : นำ ปูเนื้อ มาล้างให้สะอาด โดยใช้ฟองน้ำขัดให้คราบสกปรกตามกระดองปูและขาปูออกให้หมด ก่อนนำปูมาชำแหละ แบ่งเป็นชิ้นตามคลิปวิดีโอ จากนั้นนำปูใส่ลงไปในน้ำต้มเดือดๆ ต้มให้ปูสุกเป็นเวลา 10 นาที ให้กระดองเปลี่ยนเป็นสีส้ม แล้วตักขึ้นพักไว้ เตรียมผัด",
                    "เตรียมเครื่องปรุง : ตอกไข่ลงในถ้วยเล็ก ตามด้วยซีอิ๊วขาว น้ำตาลทราย ผงกะหรี่ พริกไทย น้ำพริกเผาและน้ำมันพริกเผา คนให้ส่วนผสมเป็นเนื้อเดียวกัน พักไว้เพื่อนำไปผัดกับปู",
                    "ผัด : ตั้งกระทะเปิดไฟกลาง นำน้ำมันเทลงกระทะ จากนั้นใส่ผงกะหรี่ลงไปผัดให้หอม แล้วค่อยๆ เติม นมข้นจืด คาร์เนชัน ลงไปทีละนิด จนผงกะหรี่หอม แล้วปรับเป็นไฟแรง ตามด้วยการนำเครื่องปรุง (STEP 2) ใส่ลงในกระทะ ผัดส่วนผสมให้เข้ากันและข้นขึ้น นำปูเนื้อที่ต้มสุก (STEP 1) ลงไปผัดเคล้ากับเครื่องปรุงในถ้วย ก่อนจะใส่หัวหอมใหญ่ ต้นหอม คื่นช่าย และพริกชี้ฟ้าลงไปผัดให้เข้ากัน แล้วตักใส่จานเพื่อจัดเสิร์ฟ เท่านี้เราก็ได้ “ปูผัดผงกะหรี่” แล้ว",
                ],
            },
            {
                id_menu: 1026,
                id_create:1,
                name: "หอยแมลงภู่",
                meat: "Shellfish",
                category: "Italian",
                method: "Baked Food",
                is_favorite: false,
                select_show: false,
                image: "img-food/หอยแมลงภู่.jpg",
                material: [
                    "หอยแมลงภู่ 8 ฝา",
                    "เนยกระเทียม 100 กรัม",
                    "มอสซาเรลล่าชีสขูดเส้น 100 กรัม",
                ],
                methods: [
                    "ล้างทำความสะอาดหอยแมลงภู่นิวซีแลนด์ และตัดเนื้อหอยออกจากเอ็นเพื่อให้สะดวกเวลาทานและวางบนเปลือกใหม่ เรียงบนถาดอบ",
                    "ใช้ช้อนขูดเนยกระเทียม แล้วปาดทาลงบนเนื้อหอยให้ทั่ว",
                    "จากนั้นโรยด้านบนด้วยมอสซาเรลล่าชีส เอาเข้าอบที่ 190 องศาเซลเซียส ประมาณ 10 นาที หรือแค่พอให้ชีสละลายได้สีสวยงาม พร้อมเสิร์ฟคู่กับเลมอน",
                ],
            },
            {
                id_menu: 1027,
                id_create:1,
                name: "หมึกแดดเดียว",
                meat: "Squid",
                category: "Thai",
                method: "Baked Food",
                is_favorite: false,
                select_show: false,
                image: "img-food/หมึกแดดเดียว.jpg",
                material: [
                    "ปลาหมึกศอก 4 ตัว",
                    "เกลือ 2-3 ช้อนโต๊ะ",
                    "น้ำตาลปี๊บ 2 ช้อนโต๊ะ",
                    "น้ำ 200 กรัม",
                    "ตู้อบลมร้อน",
                ],
                methods: [
                    "ใช้กรรไกรตัดกลางลำตัว แล้วเอาอวัยวะภายใน กระดอง เมือก ถุงหมึก ลูกตา ของปลาหมึกออกให้เรียบร้อย",
                    "นำปลาหมึกใส่อ่าง แล้วเอาเกลือถูให้ทั่ว จากนั้น ล้างน้ำออกให้สะอาด แล้วพักให้สะเด็ดน้ำ",
                    "เตรียมชามผสม ใส่น้ำตาลปี๊บ เกลือ น้ำเปล่า คนให้ละลายเข้ากัน",
                    "เทน้ำปรุงใส่ปลาหมึก คลุกเคล้าให้ทั่ว แล้วหมักทิ้งไว้ 30 นาที",
                    "นำปลาหมึกที่หมักไว้ มาเรียงลง บนตะแกรง นำเข้าตู้อบลมร้อน ใช้ความร้อน 70 องศาเซลเซียส อบเป็นเวลา 3 – 4 ชั่วโมง (เวลาและอุณหภูมิปรับได้ ขึ้นอยู่กับความชื้นของปลาหมึก)",
                ],
            },
        ],
        select_id: "",
        // category list for dropdown (Add menu page)
        category_nation: ["Chinese", "Thai", "Korean", "Japanese", "Indian", "Italian", "Other Inter food", "Other"],
        category_typecook: ["Fried Food", "Stirred Food", "Boiled Food", "Grilled Food", "Baked Food", "Steamed Food", "Other Method"],
        category_meat: ["Pork", "Chicken", "Duck", "Beef", "Mutton", "Fish", "Shellfish", "Crab", "Shrimp", "Squid", "Other Meat", "No Meat"]
    },
    methods: {
        findIndex(menu, index) {
            select_menu = false;
        },
        isFavorite(menu){
            console.log(menu);
            console.log(menu.id_menu);
            menu.is_favorite = !menu.is_favorite;
            const myJSON = JSON.stringify(this.products);
            localStorage.setItem("all_menu", myJSON);
        },
        addMenu(){
            // add menu info
            this.products.push({"id_menu": this.id_menu, "id_create":1, "name": this.name, "meat": this.meat, "method": this.method, 
            "category": this.category, "is_favorite": this.is_favorite, "select_show": this.select_show, "image": this.image, "days": this.days,
            "hours": this.hours, "minutes": this.minutes, "material": this.material, "methods": this.methods});

            this.id_menu++;
            // local storage
            const myJSON = JSON.stringify(this.products);
            localStorage.setItem("all_menu", myJSON);
            this.name = "";
            this.meat = "Pork";
            this.method = "Fried Food";
            this.category = "Chinese";
            this.image = "";
            this.methods = [];
            this.material = [];
            this.days = "0";
            this.hours = "0";
            this.minutes = "0";    
        },
        // on change image
        loadImg(event){
            const file = event.target.files[0];
            this.image = URL.createObjectURL(file);
            this.iconDisplay = 'none';
        },
        // เพิ่มวัตถุดิบทีละข้อลง array
        addMaterial(){
            this.material.push(this.ingrediant);
            this.ingrediant = "";
        },
        // เพิ่มวิธีทำทีละข้อลง array
        addMethods(){
            this.methods.push(this.howTo);
            this.howTo = "";
        },
        //หน้า update menu
        setMenuNew(menu){
            console.log(menu);
            this.name = menu.name;
            this.meat = menu.meat;
            this.method = menu.method;
            this.category = menu.category;
            this.image = menu.image;
            this.days = menu.days;
            this.hours = menu.hours;
            this.minutes = menu.minutes;
            this.material = menu.material;
            this.methods = menu.methods;
        },
        addMaterial_mymenu(index_menu){
            console.log( this.products[index_menu].material)
            this.products[index_menu].material.push(this.ingrediant);
            // const myJSON = JSON.stringify(this.products);
            // localStorage.setItem("all_menu", myJSON);
            this.ingrediant = "";
        },
        addMethods_mymenu(index_menu){
            this.products[index_menu].methods.push(this.howTo);
            // const myJSON = JSON.stringify(this.products);
            // localStorage.setItem("all_menu", myJSON);
            this.howTo = "";
        },
        delete_menu(menu, index){
            this.products.splice(index, 1);
            const myJSON = JSON.stringify(this.products);
            localStorage.setItem("all_menu", myJSON);
        },
        updateMenu(index_menu,menu){
            this.products.splice(index_menu, 1);
            // add menu info
            this.products.push({"id_menu": this.id_menu, "id_create":1, "name": this.name, "meat": this.meat, "method": this.method, 
            "category": this.category, "is_favorite": this.is_favorite, "select_show": this.select_show, "image": this.image, "days": this.days,
            "hours": this.hours, "minutes": this.minutes, "material": this.material, "methods": this.methods});

            this.id_menu++;
            // local storage
            const myJSON = JSON.stringify(this.products);
            localStorage.setItem("all_menu", myJSON);
        }
    },

    created() {

        let text = localStorage.getItem("ID");
        this.select_id = JSON.parse(text);
        console.log(this.select_id);

        let all = localStorage.getItem("all_menu");
        if(all){
            this.products = JSON.parse(all);
        }

    },
    computed: {
        test() {
            var result = this.products.filter(
            (products) =>
                products.category === this.select_id ||
                products.method === this.select_id ||
                products.meat === this.select_id
            );
            console.log(result);
            return result;
        },
        favorite_at_all(){
            const result = this.products.filter(
                (products) =>
                    products.is_favorite === true
            );

            console.log(result);
            return result;
        },
        list_material(){
            return this.material;
        },
        list_methods(){
            return this.methods;
        },
        my_menu_all(){
            const result = this.products.filter(
                (products) =>
                    products.id_create === 1
            );

            console.log(result);
            return result;
        },
    },
});
